Tekla.Structures.Model.InvalidFacePointsException
The InvalidFacePointsException class represents an error when, cannot create geometry from requested face points.

Tekla.Structures.Model.InvalidFacePointsException.#ctor
Initializes a new instance of the InvalidFacePointsException class with "Cannot create geometry from requested face points" error message.